Revit 2027 API
ExternalResourceTypes.BuiltInExternalResourceTypes.RevitLink Property
 An external resource type representing Revit Links data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalResourceType RevitLink { get; }
Public Shared ReadOnly Property RevitLink As ExternalResourceType
	Get
public:
static property ExternalResourceType^ RevitLink {
	ExternalResourceType^ get ();
}
static member RevitLink : ExternalResourceType with get
Property Value
ExternalResourceType
See Also
Reference
ExternalResourceTypes.BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace